Revit 2024 API
BuiltInFailures.RebarFailures.RebarDimensionalConstraintLost Property
 Dimensional constraint on Rebar element was lost on upgrade.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RebarDimensionalConstraintLost { get; }
Visual Basic
Public Shared ReadOnly Property RebarDimensionalConstraintLost As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RebarDimensionalConstraintLost {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace